Revit 2027 API
UV.IsAlmostEqualTo(UV, Double) Method
Determines whether this 2-D vector and the specified 2-D vector are the same within a specified tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAlmostEqualTo(
	UV source,
	double tolerance
)
Public Function IsAlmostEqualTo (
	source As UV,
	tolerance As Double
) As Boolean
public:
bool IsAlmostEqualTo(
	UV^ source,
	double tolerance
)
member IsAlmostEqualTo :
        source : UV *
        tolerance : float -> bool
Parameters
source UV
The vector to compare with this vector.
tolerance Double
The tolerance for equality check.
Return Value
Boolean
True if the vectors are the same; otherwise, false.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
ArgumentException |  Thrown when tolerance is less than 0.
See Also
Reference
UV Class
IsAlmostEqualTo Overload
Autodesk.Revit.DB Namespace